<a href="https://colab.research.google.com/github/Carlosrbrj/PUCrio/blob/main/PsotgreSQL_Ambiente_Colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Objetivo do Notebook

O principal objetivo desse notebook é criar um ambiente de PostgreSQL no Colab. Aqui, usaremos essa estrutura para treinar tipos de consultas SQL DML.

## Instalando e configurando PostgreSQL

O bloco de código abaixo instala o SGBD PostgreSQL

In [ ]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

Collecting sqlalchemy==2.0
  Downloading SQLAlchemy-2.0.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.7/2.7 MB 16.8 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (3.0.3)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.30
    Uninstalling SQLAlchemy-2.0.30:
      Successfully uninstalled SQLAlchemy-2.0.30
Successfully installed sqlalchemy-2.0.0
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 13.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package logrotate.
(Reading database ... 121918 files and directories currently installed.)
Preparing to unpack .../00-logrotate_3.19.0-1ubuntu1.1_amd64.deb ...
Unpacking logrotate (3.19.0-1ubuntu1.1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../01-netbase_6.3_all.deb ...
Unpacking netbase (6.3) ...
Selecting previously unselected package libcommon-sense-perl:amd64.
Preparing to unpack .../02-libcommon-sense-perl_3.75-2build1_amd64.deb ...
Unpacking libcommon-sense-perl:amd64 (3.75-2build1) ...
Selecting previously unselected package libjson-perl.
Preparing to unpack .../03-libjson-perl_4.04000-1_all.deb ...
Unpacking libjson-perl (4.04000-1) ...
Selecting previously unselected package libtypes-serialiser-perl.
Preparing to unpack .../04-libtypes-serialiser-perl_1.01-1_all.deb ...
Unpacking libtypes-serialiser-perl (1.01-1) ...
Selecting previously unselected package libjson-xs-perl.
Preparing to unpack .../05-libjson-xs-perl_4.030-1build3_amd64.deb ...
Unpacking libjson-xs-perl (4.030-1build3) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../06-postgresql-client-common_238_all.deb ...
Unpacking postgresql-client-common (238) ...
Selecting previously unselected package postgresql-client-14.
Preparing to unpack .../07-postgresql-client-14_14.11-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-client-14 (14.11-0ubuntu0.22.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../08-ssl-cert_1.1.2_all.deb ...
Unpacking ssl-cert (1.1.2) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../09-postgresql-common_238_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (238) ...
Selecting previously unselected package postgresql-14.
Preparing to unpack .../10-postgresql-14_14.11-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-14 (14.11-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../11-postgresql_14+238_all.deb ...
Unpacking postgresql (14+238) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../12-sysstat_12.5.2-2ubuntu0.2_amd64.deb ...
Unpacking sysstat (12.5.2-2ubuntu0.2) ...
Setting up logrotate (3.19.0-1ubuntu1.1) ...
Created symlink /etc/systemd/system/timers.target.wants/logrotate.timer → /lib/systemd/system/logrotate.timer.
Setting up libcommon-sense-perl:amd64 (3.75-2build1) ...
Setting up ssl-cert (1.1.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Setting up libtypes-serialiser-perl (1.01-1) ...
Setting up libjson-perl (4.04000-1) ...
Setting up netbase (6.3) ...
Setting up sysstat (12.5.2-2ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-collect.timer → /lib/systemd/system/sysstat-collect.timer.
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-summary.timer → /lib/systemd/system/sysstat-summary.timer.
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up postgresql-client-common (238) ...
Setting up libjson-xs-perl (4.030-1build3) ...
Setting up postgresql-client-14 (14.11-0ubuntu0.22.04.1) ...
update-alternatives: using /usr/share/postgresql/14/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-common (238) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
Setting up postgresql-14 (14.11-0ubuntu0.22.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 14/main ...
/usr/lib/postgresql/14/bin/initdb -D /var/lib/postgresql/14/main --auth-local peer --auth-host scram-sha-256 --no-instructions
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/14/main ... ok
creating subdirectories ... ok
selecting dynamic shared memory implementation ... posix
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default time zone ... Etc/UTC
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok
update-alternatives: using /usr/share/postgresql/14/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (14+238) ...
Processing triggers for man-db (2.10.2-1) ...
 * Starting PostgreSQL 14 database server
   ...done.
ALTER ROLE

## Passo 3 - Esquema relacional de teste

O bloco de código abaixo cria o diretório do Google Drive no colab, onde salvei o esquema relacional para testes.

In [ ]:
# [2.1] Monta o diretório do Google Drive no seu Colab
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

O código abaixo cria o esquema de dados no Colab que será usado para testes.

In [ ]:
# [2.2] Cria o esquema no banco de dados no Colab
# %%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS carros CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA carros;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f drive/MyDrive/esquema_carros.sql

DROP SCHEMA
CREATE SCHEMA
SET SCHEMA 'carros';
SET
CREATE TABLE carros.automoveis (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    fabricante character(20),
    modelo character(20),
    preco_tabela numeric(8,2),
    pais character(20)
);
CREATE TABLE
CREATE TABLE carros.consumidores (
    cpf character(12) NOT NULL,
    nome character(15),
    sobrenome character(15),
    cidade character(25),
    estado character(2)
);
CREATE TABLE
CREATE TABLE carros.garagens (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    cgc integer NOT NULL,
    quantidade integer
);
CREATE TABLE
CREATE TABLE carros.negocios (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    cgc integer NOT NULL,
    cpf character(12) NOT NULL,
    data date,
    preco numeric(8,2)
);
CREATE TABLE
CREATE TABLE carros.revendedoras (
    cgc integer NOT NULL,
    nome character(20),
    estado character(2),
    cidade character(25),
    proprietario character(12)
);
CREATE TABLE
CREATE FUNCTION carros.conta(cgc_in integer, ano_in character) RETURNS integer
    LANGUAGE plpgsql
    AS $$
DECLARE
    total integer;
BEGIN
    select sum(quantidade) into total
    from garagens g where g.cgc = cgc_in and g.ano = ano_in;
    return total;
END;
$$;
CREATE FUNCTION
CREATE FUNCTION carros.increment(i integer) RETURNS integer
    LANGUAGE plpgsql
    AS $$
        BEGIN
                RETURN i + 1;
        END;
$$;
CREATE FUNCTION
CREATE FUNCTION carros.tem_estoque() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
DECLARE
    qtd integer;
BEGIN
    qtd:=0;
    select quantidade into qtd from garagens g
    where g.cgc = New.cgc and g.codigo = New.codigo and g.ano = New.ano;
    RAISE INFO 'qtd=%', qtd;
    if (qtd<=0) or qtd is NULL then
        RAISE EXCEPTION 'Nao tem o carro % - ano % em estoque', NEW.codigo, NEW.ano;
    RETURN NULL;
    end if;
    RETURN NEW;
END;
$$;
CREATE FUNCTION
INSERT INTO carros.automoveis VALUES (1022, '85', 'Ford                ', 'Del Rey             ', 4800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '88', 'Fiat                ', 'Elba                ', 6200.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '89', 'Fiat                ', 'Elba                ', 7600.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '87', 'Ford                ', 'Escort              ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '88', 'Ford                ', 'Escort              ', 7800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1013, '95', 'Volkswagen          ', 'Kombi               ', 12000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '94', 'General Motors      ', 'Monza               ', 18000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '95', 'Volkswagen          ', 'Parati              ', 15200.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1071, '93', 'Gurgel              ', 'BR800               ', 6500.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '90', 'Honda               ', 'Accord              ', 37000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1281, '94', 'Hyundai             ', 'Excel               ', 19500.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1101, '92', 'Lada                ', 'Laika               ', 5500.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1101, '93', 'Lada                ', 'Laika               ', 6200.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '93', 'Fiat                ', 'Tempra              ', 18800.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1111, '95', 'Suzuki              ', 'Sidekick            ', 36000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1102, '92', 'Lada                ', 'Niva                ', 7800.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1071, '94', 'Gurgel              ', 'BR800               ', 7500.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1131, '95', 'Peugeot             ', '205                 ', 11400.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1053, '95', 'Fiat                ', 'Tipo                ', 13000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1082, '95', 'Honda               ', 'Civic               ', 22870.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1141, '95', 'Audi                ', '80                  ', 52000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1142, '95', 'Audi                ', '100                 ', 60000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1151, '95', 'BMW                 ', '318                 ', 51000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '90', 'Volkswagen          ', 'Apollo              ', 9000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '92', 'Volkswagen          ', 'Apollo              ', 10600.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '94', 'Volkswagen          ', 'Parati              ', 12400.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '88', 'General Motors      ', 'Monza               ', 7500.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '94', 'Fiat                ', 'Tempra              ', 20500.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '89', 'Ford                ', 'Escort              ', 8300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '90', 'Fiat                ', 'Elba                ', 10800.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '90', 'Ford                ', 'Escort              ', 9000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '89', 'Ford                ', 'Belina              ', 8800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1033, '95', 'Chevrolet           ', 'Corsa GL            ', 11950.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '93', 'Volkswagen          ', 'Apollo              ', 11100.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '95', 'Fiat                ', 'Tempra              ', 34000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1161, '95', 'Volvo               ', '460                 ', 40000.00, 'Suecia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1171, '95', 'Daihatsu            ', 'Charade             ', 20000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1181, '95', 'Porsche             ', '938 GTS             ', 180000.00, 'UK                  ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1132, '95', 'Peugeot             ', '405                 ', 30000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1133, '95', 'Peugeot             ', '605                 ', 55000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1282, '95', 'Hyundai             ', 'Elantra             ', 27000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1162, '95', 'Volvo               ', '850                 ', 70000.00, 'Suecia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1191, '95', 'Mercedez Benz       ', 'C200                ', 60000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1122, '95', 'Renault             ', '19                  ', 25000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '86', 'Ford                ', 'Del Rey             ', 6000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '92', 'Ford                ', 'Escort              ', 9700.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '93', 'Ford                ', 'Escort              ', 10800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '95', 'Fiat                ', 'Elba                ', 18300.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '89', 'General Motors      ', 'Monza               ', 9800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1103, '92', 'Lada                ', 'Samara              ', 8000.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1152, '95', 'BMW                 ', '325                 ', 68000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1153, '95', 'BMW                 ', '530                 ', 93000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1201, '95', 'Ferrari             ', '512                 ', 330000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1211, '95', 'Land Rover          ', 'Defender            ', 35000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1221, '95', 'Mitsubishi          ', 'Pajero              ', 45000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1231, '95', 'Mazda               ', '626                 ', 36000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1123, '95', 'Renault             ', 'Nevada              ', 27000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1241, '95', 'Rolls Royce         ', 'Corniche            ', 499000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1112, '95', 'Suzuki              ', 'Canvas              ', 15000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1192, '95', 'Mercedez Benz       ', 'C280                ', 70000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1251, '95', 'Toyota              ', 'Paseo               ', 35000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1043, '95', 'Citroen             ', 'ZX                  ', 30000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '88', 'Ford                ', 'Belina              ', 8000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1104, '92', 'Lada                ', 'Pantanal            ', 8500.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '91', 'Ford                ', 'Escort              ', 14400.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '92', 'Chevrolet           ', 'Chevette            ', 7200.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '95', 'Honda               ', 'Accord              ', 48000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '87', 'Ford                ', 'Del Rey             ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '90', 'Volkswagen          ', 'Gol                 ', 7300.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '92', 'Volkswagen          ', 'Gol                 ', 8000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '94', 'Volkswagen          ', 'Gol                 ', 9300.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1031, '95', 'Chevrolet           ', 'Corsa Wind          ', 7350.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '93', 'Fiat                ', 'Elba                ', 12600.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1261, '95', 'Nissan              ', 'Sentra              ', 38000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1113, '95', 'Suzuki              ', 'Vitara              ', 25000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1222, '95', 'Mitsubishi          ', 'Galant              ', 40000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1154, '95', 'BMW                 ', '840                 ', 147000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1232, '95', 'Mazda               ', 'MX                  ', 32000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1252, '95', 'Toyota              ', 'Corolla             ', 38000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '93', 'Volkswagen          ', 'Parati              ', 10800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '93', 'Honda               ', 'Accord              ', 40000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '93', 'General Motors      ', 'Monza               ', 16000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '90', 'General Motors      ', 'Monza               ', 11000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '90', 'Volkswagen          ', 'Parati              ', 8800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1044, '95', 'Citroen             ', 'XM                  ', 65000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1124, '95', 'Renault             ', '21                  ', 29000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1202, '95', 'Ferrari             ', '348                 ', 215000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1233, '95', 'Mazda               ', 'Protege             ', 26000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1262, '95', 'Nissan              ', 'Pathfinder          ', 43000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1182, '95', 'Porsche             ', '921 Carrera         ', 140000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1271, '95', 'Daewoo              ', 'Espero              ', 23000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1041, '94', 'Citroen             ', 'AX                  ', 21000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '87', 'Ford                ', 'Belina              ', 5700.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1212, '95', 'Land Rover          ', 'Discovery           ', 63000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1114, '95', 'Suzuki              ', 'Swift               ', 20000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1193, '95', 'Mercedes Benz       ', 'E280                ', 85000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1172, '95', 'Daihatsu            ', 'Feroza              ', 28000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1253, '95', 'Toyota              ', 'Previa              ', 68000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1194, '95', 'Mercedes Benz       ', 'S500                ', 170000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1223, '95', 'Mitsubishi          ', 'Lancer              ', 29000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '89', 'Ford                ', 'Del Rey             ', 9300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '94', 'Ford                ', 'Escort              ', 12500.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '92', 'Volkswagen          ', 'Parati              ', 9800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1254, '95', 'Toyota              ', 'Hilux               ', 52000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1115, '95', 'Suzuki              ', 'Samurai             ', 18000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1083, '95', 'Honda               ', 'Legend              ', 90000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (99000, '02', 'Renault             ', 'Twingo              ', 11890.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '93', 'Chevrolet           ', 'Chevette            ', 7900.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '89', 'Chevrolet           ', 'Chevette            ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '87', 'Chevrolet           ', 'Chevette            ', 6000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '84', 'Chevrolet           ', 'Chevette            ', 4300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '93', 'Volkswagen          ', 'Gol                 ', 8600.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '95', 'Volkswagen          ', 'Gol                 ', 10500.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1041, '95', 'Citroen             ', 'AX                  ', 25000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (99001, '02', 'Citroen             ', 'C5                  ', 16000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (88374, '99', 'Jac                 ', 'J3                  ', 4800.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (957798, '02', 'Ford                ', 'Fiesta              ', 100000.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1300, '17', 'Fiat                ', 'Uno 2016            ', 50000.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1042, '19', 'Citroen             ', 'Xantia              ', 46000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1121, '95', 'Renault             ', 'Twin                ', 11322.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1020, '85', 'Ford                ', 'Del Rey             ', 4105.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1306, '20', 'Suzuki              ', 'Jimmy               ', 66288.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1308, '20', 'Peugeot             ', '2008                ', 65817.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (101, '89', 'Ford                ', 'Ka                  ', 50.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (100, '90', 'Ford                ', 'Ka                  ', 100.00, 'EUA                 ');
INSERT 0 1

## Passo 3 - Preparando o SGBB PostgreSQL Localmente

O bloco de código abaixo prepara o ambiente de PostgreSQL localmente. Com ele instalado, as consultas de SQL devem ser feitas utilizando o início de código: "%%sql"

In [ ]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

# Práticas de consulta SQL - PUC-rio

Esta sessão se dedica a resolução dos exercícios propostos de consulta do primeiro módulo de engenharia de dados da Pós em Ciência de Dados da PUC-rio.

In [ ]:
%sql postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Escolhe o esquema carros como o esquema em que serão feitas as consultas
# (deve-se executar essa célula sempre que for trocar para o esquema carros)
%%sql
SET SCHEMA 'carros';

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

## 1. Quais automóveis italianos na base de dados?

Para rodar a consulta em SQL abaixo, basta dar PLAY nesta célula! Se quiser, pode mudar o país e verificar as respostas (instâncias!) distintas.

In [ ]:
%%sql

SELECT *
FROM automoveis
WHERE pais = 'Italia' ;

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(1051, '88', 'Fiat                ', 'Elba                ', Decimal('6200.00'), 'Italia              '),
 (1051, '89', 'Fiat                ', 'Elba                ', Decimal('7600.00'), 'Italia              '),
 (1052, '93', 'Fiat                ', 'Tempra              ', Decimal('18800.00'), 'Italia              '),
 (1053, '95', 'Fiat                ', 'Tipo                ', Decimal('13000.00'), 'Italia              '),
 (1052, '94', 'Fiat                ', 'Tempra              ', Decimal('20500.00'), 'Italia              '),
 (1051, '90', 'Fiat                ', 'Elba                ', Decimal('10800.00'), 'Italia              '),
 (1052, '95', 'Fiat                ', 'Tempra              ', Decimal('34000.00'), 'Italia              '),
 (1051, '95', 'Fiat                ', 'Elba                ', Decimal('18300.00'), 'Italia              '),
 (1201, '95', 'Ferrari             ', '512                 ', Decimal('330000.00'), 'Italia              '),
 (1051, '93', 'Fiat                ', 'Elba                ', Decimal('12600.00'), 'Italia              '),
 (1202, '95', 'Ferrari             ', '348                 ', Decimal('215000.00'), 'Italia              ')]

## 2. Listar os nomes dos fabricantes dos automóveis na base de dados e os respectivos países de origem.

In [ ]:
%%sql

Select distinct fabricante ,
  pais
From automoveis

 * postgresql://postgres:***@localhost:5432/postgres
32 rows affected.

[('Audi                ', 'Alemanha            '),
 ('Hyundai             ', 'Coreia              '),
 ('Honda               ', 'Japao               '),
 ('Ford                ', 'Brasil              '),
 ('Jac                 ', 'Brasil              '),
 ('Chevrolet           ', 'EUA                 '),
 ('Daewoo              ', 'Coreia              '),
 ('BMW                 ', 'Alemanha            '),
 ('Volkswagen          ', 'Alemanha            '),
 ('Fiat                ', 'Brasil              '),
 ('Mazda               ', 'Japao               '),
 ('Porsche             ', 'Inglaterra          '),
 ('Citroen             ', 'Franca              '),
 ('Peugeot             ', 'Franca              '),
 ('Gurgel              ', 'Brasil              '),
 ('Fiat                ', 'Italia              '),
 ('Nissan              ', 'Japao               '),
 ('General Motors      ', 'EUA                 '),
 ('Ford                ', 'EUA                 '),
 ('Mercedez Benz       ', 'Alemanha            '),
 ('Porsche             ', 'UK                  '),
 ('Volvo               ', 'Suecia              '),
 ('Daihatsu            ', 'Coreia              '),
 ('Mercedes Benz       ', 'Alemanha            '),
 ('Toyota              ', 'Japao               '),
 ('Ferrari             ', 'Italia              '),
 ('Rolls Royce         ', 'Inglaterra          '),
 ('Land Rover          ', 'Inglaterra          '),
 ('Mitsubishi          ', 'Japao               '),
 ('Suzuki              ', 'Japao               '),
 ('Renault             ', 'Franca              '),
 ('Lada                ', 'Russia              ')]

## 3. Listar os nomes das pessoas que são potenciais compradoras de automóveis, moradoras do estado do Rio de Janeiro, e que também sejam proprietárias de revendedoras

In [ ]:
%%sql

select
  cpf,
  nome
from consumidores
where estado = 'RJ'
and cpf in (select cpf
            from revendedoras)

 * postgresql://postgres:***@localhost:5432/postgres
40 rows affected.

[('6030-0      ', 'Joao           '),
 ('5002-2      ', 'Antonio        '),
 ('7450-0      ', 'Vitor          '),
 ('9010-0      ', 'Danuza         '),
 ('8999-9      ', 'Paulo          '),
 ('7451-1      ', 'Marcos         '),
 ('5637-7      ', 'Roberto        '),
 ('6228-8      ', 'Benedita       '),
 ('5112-2      ', 'Filipe         '),
 ('6789-9      ', 'Vicente        '),
 ('8981-1      ', 'Gilberto       '),
 ('8894-4      ', 'Tereza         '),
 ('5371-1      ', 'Luis Fernando  '),
 ('8775-5      ', 'Leonel         '),
 ('9888-8      ', 'Roberto        '),
 ('5598-8      ', 'Marina         '),
 ('5698-8      ', 'Romario        '),
 ('6565-5      ', 'Claudio        '),
 ('7659-9      ', 'Joao           '),
 ('6568-8      ', 'Caetano        '),
 ('8745-5      ', 'Vera           '),
 ('6551-1      ', 'Adolpho        '),
 ('7554-4      ', 'Sergio         '),
 ('8973-3      ', 'Artur          '),
 ('5677-7      ', 'Camila         '),
 ('8876-6      ', 'Cid            '),
 ('7677-7      ', 'Marisa         '),
 ('8699-9      ', 'Tonia          '),
 ('7633-3      ', 'Jose Bonifacio '),
 ('9594-4      ', 'Ivo            '),
 ('9831-1      ', 'Oswaldo        '),
 ('9785-5      ', 'Marcello       '),
 ('6738-8      ', 'Roberto        '),
 ('5775-5      ', 'Cassia         '),
 ('6734-4      ', 'Getulio        '),
 ('9993-3      ', 'Francisco      '),
 ('8744-4      ', 'Jose Carlos    '),
 ('7355-5      ', 'Kleber         '),
 ('8746-6      ', 'Armando        '),
 ('1000-1      ', 'João           ')]

## 4. Quais revendedoras presentes nos estados da Bahia e Pernambuco?

In [ ]:
%%sql

select *
from revendedoras
where estado = 'RJ' or estado = 'PE'
Order by estado

 * postgresql://postgres:***@localhost:5432/postgres
24 rows affected.

[(10310, 'Lian                ', 'PE', 'Recife                   ', '7192-2      '),
 (10790, 'Caltabiano          ', 'PE', 'Recife                   ', '9753-3      '),
 (10080, 'Self Car            ', 'PE', 'Recife                   ', '5698-8      '),
 (10180, 'Libra               ', 'PE', 'Olinda                   ', '6565-5      '),
 (10040, 'Fracalanza          ', 'PE', 'Olinda                   ', '7192-2      '),
 (10420, 'Cavox               ', 'PE', 'Recife                   ', '5698-8      '),
 (10140, 'Exclusive           ', 'RJ', 'Rio de Janeiro           ', '6565-5      '),
 (10340, 'Dirija              ', 'RJ', 'Angra dos Reis           ', '9753-3      '),
 (10750, 'La Penna            ', 'RJ', 'Rio de Janeiro           ', '7192-2      '),
 (10010, 'Self Car            ', 'RJ', 'Rio de Janeiro           ', '5698-8      '),
 (10760, 'Duarte Chaves       ', 'RJ', 'Angra dos Reis           ', '7192-2      '),
 (849274, 'RevDoHugo           ', 'RJ', 'RJ                       ', '8745-5      '),
 (849275, 'RevDoHugo2          ', 'RJ', 'RJ                       ', '8745-5      '),
 (10130, 'Rivel               ', 'RJ', 'Itaborai                 ', '5698-8      '),
 (10810, 'Mirafiori           ', 'RJ', 'Rio de Janeiro           ', '5698-8      '),
 (10220, 'Rio Motor           ', 'RJ', 'Rio de Janeiro           ', '5698-8      '),
 (10700, 'Brasilwagen         ', 'RJ', 'Rio de Janeiro           ', '5698-8      '),
 (10680, 'Vipa                ', 'RJ', 'Resende                  ', '5698-8      '),
 (10070, 'Katai               ', 'RJ', 'Rio de Janeiro           ', '7192-2      '),
 (10330, 'Dirija              ', 'RJ', 'Campos                   ', '5698-8      '),
 (10690, 'Sopave              ', 'RJ', 'Rio de Janeiro           ', '5698-8      '),
 (10200, 'Izio                ', 'RJ', 'Petropolis               ', '5698-8      '),
 (10510, 'Del Serra           ', 'RJ', 'Petropolis               ', '6675-5      '),
 (10270, 'Lian                ', 'RJ', 'Campos                   ', '6675-5      ')]

## 5. Quais são os automóveis no banco de dados, com valor tabelado superior a 120 mil reais, que ainda não foram comprados por consumidor algum?

In [ ]:
%%sql

select *
from automoveis
where preco_tabela > 120000
AND (Codigo, Ano) NOT IN
(SELECT Codigo, Ano FROM Negocios)

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[(1181, '95', 'Porsche             ', '938 GTS             ', Decimal('180000.00'), 'UK                  '),
 (1201, '95', 'Ferrari             ', '512                 ', Decimal('330000.00'), 'Italia              '),
 (1241, '95', 'Rolls Royce         ', 'Corniche            ', Decimal('499000.00'), 'Inglaterra          '),
 (1154, '95', 'BMW                 ', '840                 ', Decimal('147000.00'), 'Alemanha            '),
 (1202, '95', 'Ferrari             ', '348                 ', Decimal('215000.00'), 'Italia              '),
 (1182, '95', 'Porsche             ', '921 Carrera         ', Decimal('140000.00'), 'Inglaterra          '),
 (1194, '95', 'Mercedes Benz       ', 'S500                ', Decimal('170000.00'), 'Alemanha            ')]

## 6. Quais revendedoras (CGC) têm para vender automóveis dos anos 88 e 89?

In [ ]:
%%sql

select distinct cgc
from garagens
where ano in ('88', '89')

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(10030,), (10930,), (10310,), (10780,), (10980,), (10200,)]